{
    "detected_language": "en",
    "full_text": "This is the greatest iPhone the world has ever seen. We've been working on it for over a year now, while we've been racing to overtake Apple and subscribers. And now that we've just passed them, it's time to show the world. Three, two, one. There you go. This thing is built from scratch. It's the actual supercomputer of smartphones, and there are seven things it can do that will make your current phone look like a toy. Like, for example, the first.  This is no normal phone camera. Oh, actually, I just remembered. We have a peel to do. World's largest phone peel in three, two, one. Look at that. I can't reach.  Behind this glass is actually a full-frame Canon EOS R5. We're talking a camera that shoots very good, full-quality 8K resolution video. Yeah, why don't we start a cost tally too? That'll be fun.  So that one camera has cost us $3,500. And I'm not going to get too technical here, but just to give you an idea, the best indicator of a camera's quality is its sensor size. That's why pretty much every other year, smartphone companies increase the size of their sensors by 10% to 15%. This camera sensor is over 1,000% larger than that of the latest Pro iPhones. Your move, Tim. Wow. So, time to put it to the test. Ah, the Apple Store London.  Mine's bigger. So this is the camera app. And because the actual camera itself is locked away on the inside, what we've had to do here is to get a SIM and a very real data plan so that we can use Canon's Wi-Fi Link app to have a live feed of what the camera is seeing in real time. All right, let's go.  Oh, this feels good. I mean, just look at the difference in detail, the warmth of the colors, and just how cinematic our camera looks in comparison. Also, if you're curious about the video quality, I don't think I've ever looked this pretty before. And because this is an 8K resolution recording, we've absolutely smoked the Apple iPhone in terms of detail.  Also, if you're wondering why there's a single macho plaster on my face, it's because I walked straight into a pole while heaving this beast of a phone around London. But every top-end smartphone also has a zoom camera. And of course, we need to top that as well. If you see me shaking at all during this video, by the way, it's because I'm very nervous. The Guinness World Record adjudicator is on her way right now. And if she likes what she sees, we will actually walk away today with a Guinness World Record. Yeah.  Let's hope so. There's a lot at stake here. Okay, so here's the thing with zoom. To create more zoom, you have to create more distance between your camera's sensor and the glass in your lens. So if we just plopped a second zoom camera right next to our main camera facing outwards like this, then the maximum amount of optical zoom we could achieve in that depth is about seven times. Now, seven times optical zoom...  That's already pretty good. The latest Pro iPhones come with five times optical zoom, and that's about as high as phones get. But we don't want to just match the iPhone. We want to far surpass it. We want to beat every future possible generation of iPhones. So this second zoom camera, which is the Sony RX10 Mark IV, by the way, isn't actually sitting here firing outwards. It's sitting here firing vertically up the phone with a mirror to then reflect that view outwards, which allows us to create the maximum possible distance between the sensor and the glass.  And this isn't just any mirror. Normal mirrors have either glass or plastic in front of the reflective surface. But this one has the reflective surface on the front side, making for zero degradation to image quality. What does that mean for optical zoom? 25 times. And if you're happy to use digital zoom, then you can go up to 100 times and still get a clear photo. If you run to that corner over there, I'm going to see if I can find you. Oh yeah, and you know the other benefit of having a mirror periscope system like this is...  It's adjustable. I hold down one button on this remote, and this mirror micro-adjusts its angle, which means we can change where we're shooting without even moving the phone. All right, so we're going to zoom in to Drisha using an iPhone. Three, two, one. Image, image. So 25 times is the maximum amount of digital zoom. And now on the big iPhone, we can't see her very well. The feed quality isn't the best, but zoom and zoom and zoom. There she is. Let's capture her.  Oh my goodness, look at that. I probably don't need to explain why ours is better. So what is powering this phone? Well, you might know that Apple themselves have a very closed, controlled way of making products, which means that the only way to actually run iOS is to buy an iPhone. You can't run iOS on any other device. So this is actually running Android with many, many different applications and skins to make it look as close to iOS as possible. But that's not a quirk, that's a feature.  Yeah, because Android is so much more open, what it's allowed us to do is to basically build a very high-end PC on the inside to power it. And that took a lot of trial and error. We even tried the latest NVIDIA RTX 4090, but no luck. We had to do a lot of experimentation for the correct hardware configuration for this. Just to give you some perspective, the absolute best iPhones have 8GB of RAM and a tiny little mobile chip. Our iPhone has 128GB of RAM.  It has the AMD 6950 XT dedicated graphics card and a 24-core Intel Core i9 processor. It's pretty insane. Making this possibly the most powerful Android device in the world. But it can do something that an iPhone just can't do. Yeah. So most top-end phones nowadays, they start out at around 256 gigabytes of internal storage and they max out at one terabyte. This has four terabytes of space.  And what we've done with that four terabytes is to create a partition, meaning that we've allocated two terabytes to run Android with more storage than any Android phone ever, but then the other two terabytes to run Windows. So every time you boot the thing up, you just decide which of these two operating systems that you want to boot into, which means, yes, this thing can basically do everything.  Oh yeah, and there's also two water cooling systems inside this phone. One for the processor, which is kind of what you might expect. One of them is for something you probably won't, but we're getting there. So we are in the very heart of London. People are starting to gather around. I feel like a street performer. But I think what everyone is here to see is a benchmark. Okay, so 3DMark, this is the extreme stress test. It's going to be quite tough. I'm going to go wildlife extreme, guys. So I'm loading up the same benchmark on both phones. Go.  Oh, the crowd is going wild. Wow! God, 230 frames per second. Oh my goodness me. iPhone 15 Pro Max Ultra. It just works. 3,767. That's the score of the iPhone. 38,559. 10 times. 10 times.  Okay, so that's all well and good, but let's see what we can do with that power. What's the max setting we can put it on? Right, well, we wait for that to load. Just so you know, by the way, I have no way of exactly measuring it, but this iPhone weighs between 150 and 200 kilograms, in part thanks to real brushed aluminum all the way around, hence the stand, which, to support something that heavy, also weighs another 100 kilograms, so...  Don't drop this thing on your face in bed. But also, I cannot state to you just how much work has gone into moving this thing around. Like, I had to call every available person I knew to spend three hours just getting it into our house, and then a full-on professional crew of six massive dudes to help get it out again to go to London. Every time you change orientation, where do you store something like this overnight? How do you get it onto a pavement? You have to think of everything. And the immense weight of the thing is also why there's room for eight detachable handles, for eight people to carry it.  This is pretty much every setting on Cyberpunk set to maximum. This doesn't feel real. I feel like I'm in some sort of weird, lucid dream. And I feel like everyone right now is watching my absolutely embarrassing gameplay in public. But now it was time to show London the final boss of video games. It's going to be a world record in two ways. Oh, my God. Oh, my God. Hi, Squaw. This is genuinely my best performance yet. I'm really happy that it's happening here. You thought it was a screen recording, right? Thank you. Thank you.  That was my best score for a really long time. There's nothing to be ashamed of. Wow, this is insane. You got it. You got it. Wow. Okay, you're high. Okay. This is the best attempt so far, apart from mine. I think 12 is really hard. Do you want me to kick the table? Oh, my God. Oh, my God.  Oh, and the other benefit of having a phone the size of like two human beings is your selfie camera can see like the entire street. Let's try and get the biggest selfie ever taken. Come on. Three, two, one. Okay, nice. Let's have a look what some light social media looks like. Ah, friction burn. I've actually burnt my finger.  There's a... Yeah, I wasn't kidding. This is what my finger looked like the next day. Genuinely, though, if you were going to endlessly browse social media, this is a healthier way of doing it. You're standing, you're moving, it's interactive.  introduces a bit of friction. Now for your favorite bit. This guy's a massive speaker head. And so when it came to the speakers on this phone, he has basically taken it upon himself to build a custom one of a kind set of speakers for this. Yeah, it needs to be as good as is possible. So it's got a transmission line subwoofer system, which means that it gets the most out of the space for deep and powerful audio.  bass. There's tubes inside that literally delay sound waves so that they come out of the phone louder. For reference, the speakers on an iPhone, which are already some of the loudest, most powerful speakers that you can get on a smartphone, these things operate at up to around 3 watts of max power. This has 50 watts.  Per speaker unit, there are eight units in total, including four subwoofer drivers purely for bass. Oh yeah, the buttons. The buttons, by the way, they feel absolutely giant, which feels like an obvious thing to say given the scale of them, but it's actually thanks to a very specific engineering decision. Yeah, behind each button is a pneumatic cylinder. These limit the speed at which the buttons can operate, giving them a sense of scale.  Yeah, and it's super satisfying. But the key thing we wanted to test here is speakers. So let's see what a video call looks like on our phone. So the idea is we're currently calling you on a normal iPhone 15 Pro. I'm going to step back. We're just going to see how far away this call starts to become a problem. Okay, so this is probably two meters. Is this about the point where it disintegrates? This is the point where your foot starts to look like it's about this long.  Why do I have big feet? Just the distortion of the edge of the legs. Oh, okay. So at about this distance, your face is starting to become dots to me. I mean, can you even hear me? I'm starting to make out about 85% of the words you're giving me. It's your noise cancellation isn't sure what's you and what's noise. Okay, that's actually spot on the feedback we wanted. Did you say you use a Galaxy Note 9 as your phone? Yeah, it's in great condition.  This has got to be, this is some sort of joke. There's got to be a reason beyond that's the phone you like. Oh, there's a new bracket this morning. I dropped it off the side of my bed this morning. It's art. He's doing an art thing. It's got to be. I just really hate switching phones. I'm going to call you on the biggest iPhone now. I feel Paul for the first time in my life. Like, does it like work, work? It works, it works, works. Yeah, it's clustered. Yeah, it's literally a giant phone screen blown up. So what about here? I assume you can still see us.  I mean, yeah, sure. You guys look small. Let's go stupidly far back. You can hear me, you can see me. The sound is very good. Okay, well, thank you. I love the fact that the camera is mounted so high. It's very clear as soon as you jump on the call with someone, they are like towering above you. I know, yeah, yeah. How much does this thing weigh? Hold on, let me guess, let me guess. I'm going to say $100,000.  and 10 kilos. Not a bad guess. Times it by three. So just to establish, we can have a full-on conversation video call from here, which is like 30 meters away from the phone. Great. Easy. All right, take care, guys. You have a great evening. Congrats on all the hard work. This seems like it was an incredible undertaking.  Yes. Congratulations, you guys. Thank you. Bye. Bye, Linus. Now, this, this screen right here is one of the things that we are most proud of. What we could have done and what we probably should have done in hindsight because it would have been a thousand times easier is just bought one of the already readily available touchscreen LCD TVs. But we didn't want to do that.  Basically, every top-end phone nowadays uses an OLED display. It uses that because it has infinitely better contrast than LCD. It has infinitely better viewing angles. The only reason you can actually see the screen from where you are is because we use this. We basically decided that if we're building the best, we need to use the best. So we found an 8K, 88-inch OLED TV from LG. It looked absolutely beautiful in person. So we covered our eyes and we clicked that purchase button because this screen alone retails for $25,000.  And since it doesn't actually exist as a touchscreen, we had to turn it into one. And that, that was a pain in the bum. Yeah, we actually broke one of these TVs during this process. It's just so difficult because what we have to do is optically laminate a touch layer onto the TV. And it's necessary to use some highly specialized optical glue for this so that it retains the OLED image quality. Yeah, and the optical glue was only available in like 50 milliliter bottles.  Yeah, we basically bought the UK's entire supply of this glue. You cannot buy it right now because we bought them out. So sorry, phone repair people. The first TV actually broke because of this glue. It's extremely runny and there was a tiny gap all the way around the TV, which it flowed into and onto some circuitry, completely destroying it. We got a 6am distress call from Matt. I think he'd broken down, basically. Things were not going to plan.  It was literally the worst thing that could have possibly happened. But we got through it. We've got a perfectly working one now. And honestly, this is pretty remarkable because you wouldn't usually see this outside of a factory setting. No one else would be stupid enough to make one. So stupid. Yeah, exactly. Do not try this at home. This might actually be the only 88-inch touchscreen OLED in the country. Very possibly. In the world. This is bespoke. Yeah. Oh, and also, we couldn't forget this.  Introducing Dynamic Continent. It's just like Dynamic Island, but it is bigger.  Okay, anyway, to keep the whole thing powered, for context, a pro level iPhone has between a 13 and a 17 watt hour battery. What we have is two Anker Solix 3840 watt hour batteries.  These ones. So yes, when one runs out, you can replace it immediately. Replaceable batteries. Don't you love to see it? And I love this. We have technically built our own port to be able to power the thing. Because, I mean, a normal USB-C wouldn't be close to enough power. And a kettle cable on its own, which is what is powering it, would just look a bit silly.  So, welcome to USB-C Pro Max Ultra as well. Why not? Pro Maximus. It's even magnetized so that it doesn't fall out. Take that, Apple. Technically, we just brought MagSafe to the charging port of an iPhone before Apple did. Yeah. Yeah, I think it's pretty safe to say that. Yeah. Cool. So, do you remember I was telling you that there's one more camera feature we wanted to talk about?  It's this. An Apple iPhone's flash module sits in the power range of 0.5 to 2 watts. We have managed to build in a 400 watt light source. Plus, it's got a lens to focus the light and throw it even further. 400 watts is so much power concentrated into a very small space. That is also why we need the second water pooling system, by the way. Okay, let's test it. Starting with a normal iPhone.  How illuminated am I? Not very. I'll be honest. You're, like, lit like a candle. Yeah, it feels like we're having, like, a romantic dinner right now. So, do you want to see the giant iPhone's flashlight? Are you going to blind me? Maybe. All right. Three, two, one. It's like the sunlight! It's actually really warm. You could sunbathe.  I feel like someone's used like a Dragon Ball Z move on me. That's phenomenal. That could light our videos. Yes, it very well could. It's a toasty thing. My God, it's like a radiator. Features you didn't know you wanted on your phone. And now, the final thing before these Guinness World Records people come.  How well can this 88-inch supercomputer high-end photography hi-fi phone actually do in your daily tasks? So we need to see if I can use it to buy stuff. We need to find out if we can make a payment with this thing. So thankfully, there is an ice cream stop right in front of us and I could kind of do with one right now. Okay, guys, pivot. Pivot.  Let's go for one scoop of brownie ice cream, please. Thank you very much. Oh, sorry. Sorry. Would you mind touching about here? You'll have to borrow. I can come. I can do it. All right. Okay. We haven't tested this. This may not work. £3.60.  If I just go slowly enough, we'll eventually come across it. I heard something. Yeah, no, it's fine. Ah, you heard it. Oh! Yes! It worked! It worked! Yes! Yes! Congratulations. You made a payment. I feel like now might be a pretty good time to email Mr. Tim Apple himself. Tim Cook at Apple.  Oh, God. Someone's got to be monitoring that inbox. Huge update sent from my Mahoosive iPhone. Perfect. Okay, I'm just going to send it, but just give me a sec. All right, Tim, if you're watching this or reading this, I would like a good morning back.  We need to see if I can use it to watch TV before bed. Every night before I sleep, I throw a show onto my laptop. So... Gently does it. Oh, my God. It's like a home cinema. That's it, I think.  It's the new setup. Quality is absolutely insane. I can see every pore on people's skin. Let's see if I can set an alarm for tomorrow. Well, that seems like a reasonable time. Good night.  So that is what our iPhone can do. The only thing left now is to see if it's good enough to win an official world record. Hello, hey. Nice to meet you.  And this looks like a massive iPhone. It does. And I'll be looking at things like, are all the exterior buttons working, the touchscreen navigation, the touchscreen keyboard, all these usual functions that you typically see with your average smartphone. Okay. Okay. And the record is determined by the length of this item, but I also need to confirm that it is a scaled-up version of the actual dimensions of an iPhone. I believe he's already getting to work on confirming that it is a 15 times scaled-up version of the original.  I'm getting really nervous. She keeps talking about ratios. I didn't quite expect just how seriously these guys take their measurements. It has to be spot on. I'm scared. It has to work. It has to work. Hey, thanks for coming. I know. Social media is very large. Your memes are 8K. Oh my God, this is crazy.  What? Okay, showtime. Let's start with the exterior buttons. So this is the lock button. So as it would be on an iPhone, that locks it. Brilliant.  They require power, but that's for a reason, to make them feel giant. So what you're doing there is changing the volume. And that top button is an action button. So the latest iPhones allow you to configure it to do one action you want, like turning on the flashlight, which is what we've done. So that is our flashlight, which is a 400-watt torch, basically.  Looking good. We're off to a good start. Let's look at some touchscreen navigation. Instagram, for example. Let's tap that. This is our page. I know it looks like I'm holding it together at this point, but I was on breaking point. I was so scared that in the moment something she wanted to see would just not work and that would be it.  Well, this record, of course, it must be based on a commercially available phone. It is a brilliant scaled-up version. The demonstration, everything you've just shown me, has gone very smoothly. So I can confirm that what you have achieved today is, in fact, a new Guinness World Record. Oh, my God! You did it. Thank you.  Let's go! The excitement is justified. You have achieved the largest smartphone replica at 2.054 meters. It's very impressive, very slick, made to a high standard, so it gives me great pleasure to present you with this official certificate. Congratulations, you're officially amazing. That is incredible. Guys, well done. Well done, we did it!  Thank you. Thank you so much. Okay. Have a look at the video on DIY Perks' channel for him building the thing as well as many other things like it. And I just want to say it feels like the start of a new era for the Misty is the Boss channel. There's a new theme song for starters, but also just generally a lot of things that we've been working on in the background that we can finally start to talk about. So it's going to be a good time. I'll catch you in the next one.  Yes, we did.",
    "segments": [
        {
            "end": 28.268,
            "start": 0.009,
            "text": " This is the greatest iPhone the world has ever seen. We've been working on it for over a year now, while we've been racing to overtake Apple and subscribers. And now that we've just passed them, it's time to show the world. Three, two, one. There you go. This thing is built from scratch. It's the actual supercomputer of smartphones, and there are seven things it can do that will make your current phone look like a toy. Like, for example, the first."
        },
        {
            "end": 54.326,
            "start": 30.145,
            "text": " This is no normal phone camera. Oh, actually, I just remembered. We have a peel to do. World's largest phone peel in three, two, one. Look at that. I can't reach."
        },
        {
            "end": 66.732,
            "start": 55.162,
            "text": " Behind this glass is actually a full-frame Canon EOS R5. We're talking a camera that shoots very good, full-quality 8K resolution video. Yeah, why don't we start a cost tally too? That'll be fun."
        },
        {
            "end": 95.981,
            "start": 67.739,
            "text": " So that one camera has cost us $3,500. And I'm not going to get too technical here, but just to give you an idea, the best indicator of a camera's quality is its sensor size. That's why pretty much every other year, smartphone companies increase the size of their sensors by 10% to 15%. This camera sensor is over 1,000% larger than that of the latest Pro iPhones. Your move, Tim. Wow. So, time to put it to the test. Ah, the Apple Store London."
        },
        {
            "end": 113.302,
            "start": 98.353,
            "text": " Mine's bigger. So this is the camera app. And because the actual camera itself is locked away on the inside, what we've had to do here is to get a SIM and a very real data plan so that we can use Canon's Wi-Fi Link app to have a live feed of what the camera is seeing in real time. All right, let's go."
        },
        {
            "end": 134.548,
            "start": 115.094,
            "text": " Oh, this feels good. I mean, just look at the difference in detail, the warmth of the colors, and just how cinematic our camera looks in comparison. Also, if you're curious about the video quality, I don't think I've ever looked this pretty before. And because this is an 8K resolution recording, we've absolutely smoked the Apple iPhone in terms of detail."
        },
        {
            "end": 159.394,
            "start": 134.548,
            "text": " Also, if you're wondering why there's a single macho plaster on my face, it's because I walked straight into a pole while heaving this beast of a phone around London. But every top-end smartphone also has a zoom camera. And of course, we need to top that as well. If you see me shaking at all during this video, by the way, it's because I'm very nervous. The Guinness World Record adjudicator is on her way right now. And if she likes what she sees, we will actually walk away today with a Guinness World Record. Yeah."
        },
        {
            "end": 179.531,
            "start": 159.394,
            "text": " Let's hope so. There's a lot at stake here. Okay, so here's the thing with zoom. To create more zoom, you have to create more distance between your camera's sensor and the glass in your lens. So if we just plopped a second zoom camera right next to our main camera facing outwards like this, then the maximum amount of optical zoom we could achieve in that depth is about seven times. Now, seven times optical zoom..."
        },
        {
            "end": 209.258,
            "start": 179.667,
            "text": " That's already pretty good. The latest Pro iPhones come with five times optical zoom, and that's about as high as phones get. But we don't want to just match the iPhone. We want to far surpass it. We want to beat every future possible generation of iPhones. So this second zoom camera, which is the Sony RX10 Mark IV, by the way, isn't actually sitting here firing outwards. It's sitting here firing vertically up the phone with a mirror to then reflect that view outwards, which allows us to create the maximum possible distance between the sensor and the glass."
        },
        {
            "end": 236.032,
            "start": 209.258,
            "text": " And this isn't just any mirror. Normal mirrors have either glass or plastic in front of the reflective surface. But this one has the reflective surface on the front side, making for zero degradation to image quality. What does that mean for optical zoom? 25 times. And if you're happy to use digital zoom, then you can go up to 100 times and still get a clear photo. If you run to that corner over there, I'm going to see if I can find you. Oh yeah, and you know the other benefit of having a mirror periscope system like this is..."
        },
        {
            "end": 265.589,
            "start": 236.391,
            "text": " It's adjustable. I hold down one button on this remote, and this mirror micro-adjusts its angle, which means we can change where we're shooting without even moving the phone. All right, so we're going to zoom in to Drisha using an iPhone. Three, two, one. Image, image. So 25 times is the maximum amount of digital zoom. And now on the big iPhone, we can't see her very well. The feed quality isn't the best, but zoom and zoom and zoom. There she is. Let's capture her."
        },
        {
            "end": 294.872,
            "start": 266.425,
            "text": " Oh my goodness, look at that. I probably don't need to explain why ours is better. So what is powering this phone? Well, you might know that Apple themselves have a very closed, controlled way of making products, which means that the only way to actually run iOS is to buy an iPhone. You can't run iOS on any other device. So this is actually running Android with many, many different applications and skins to make it look as close to iOS as possible. But that's not a quirk, that's a feature."
        },
        {
            "end": 324.172,
            "start": 294.957,
            "text": " Yeah, because Android is so much more open, what it's allowed us to do is to basically build a very high-end PC on the inside to power it. And that took a lot of trial and error. We even tried the latest NVIDIA RTX 4090, but no luck. We had to do a lot of experimentation for the correct hardware configuration for this. Just to give you some perspective, the absolute best iPhones have 8GB of RAM and a tiny little mobile chip. Our iPhone has 128GB of RAM."
        },
        {
            "end": 352.166,
            "start": 324.009,
            "text": " It has the AMD 6950 XT dedicated graphics card and a 24-core Intel Core i9 processor. It's pretty insane. Making this possibly the most powerful Android device in the world. But it can do something that an iPhone just can't do. Yeah. So most top-end phones nowadays, they start out at around 256 gigabytes of internal storage and they max out at one terabyte. This has four terabytes of space."
        },
        {
            "end": 373.343,
            "start": 352.166,
            "text": " And what we've done with that four terabytes is to create a partition, meaning that we've allocated two terabytes to run Android with more storage than any Android phone ever, but then the other two terabytes to run Windows. So every time you boot the thing up, you just decide which of these two operating systems that you want to boot into, which means, yes, this thing can basically do everything."
        },
        {
            "end": 400.681,
            "start": 373.343,
            "text": " Oh yeah, and there's also two water cooling systems inside this phone. One for the processor, which is kind of what you might expect. One of them is for something you probably won't, but we're getting there. So we are in the very heart of London. People are starting to gather around. I feel like a street performer. But I think what everyone is here to see is a benchmark. Okay, so 3DMark, this is the extreme stress test. It's going to be quite tough. I'm going to go wildlife extreme, guys. So I'm loading up the same benchmark on both phones. Go."
        },
        {
            "end": 426.073,
            "start": 403.343,
            "text": " Oh, the crowd is going wild. Wow! God, 230 frames per second. Oh my goodness me. iPhone 15 Pro Max Ultra. It just works. 3,767. That's the score of the iPhone. 38,559. 10 times. 10 times."
        },
        {
            "end": 448.701,
            "start": 426.073,
            "text": " Okay, so that's all well and good, but let's see what we can do with that power. What's the max setting we can put it on? Right, well, we wait for that to load. Just so you know, by the way, I have no way of exactly measuring it, but this iPhone weighs between 150 and 200 kilograms, in part thanks to real brushed aluminum all the way around, hence the stand, which, to support something that heavy, also weighs another 100 kilograms, so..."
        },
        {
            "end": 478.68399999999997,
            "start": 449.52,
            "text": " Don't drop this thing on your face in bed. But also, I cannot state to you just how much work has gone into moving this thing around. Like, I had to call every available person I knew to spend three hours just getting it into our house, and then a full-on professional crew of six massive dudes to help get it out again to go to London. Every time you change orientation, where do you store something like this overnight? How do you get it onto a pavement? You have to think of everything. And the immense weight of the thing is also why there's room for eight detachable handles, for eight people to carry it."
        },
        {
            "end": 507.916,
            "start": 478.68399999999997,
            "text": " This is pretty much every setting on Cyberpunk set to maximum. This doesn't feel real. I feel like I'm in some sort of weird, lucid dream. And I feel like everyone right now is watching my absolutely embarrassing gameplay in public. But now it was time to show London the final boss of video games. It's going to be a world record in two ways. Oh, my God. Oh, my God. Hi, Squaw. This is genuinely my best performance yet. I'm really happy that it's happening here. You thought it was a screen recording, right? Thank you. Thank you."
        },
        {
            "end": 531.21,
            "start": 508.65,
            "text": " That was my best score for a really long time. There's nothing to be ashamed of. Wow, this is insane. You got it. You got it. Wow. Okay, you're high. Okay. This is the best attempt so far, apart from mine. I think 12 is really hard. Do you want me to kick the table? Oh, my God. Oh, my God."
        },
        {
            "end": 557.729,
            "start": 532.729,
            "text": " Oh, and the other benefit of having a phone the size of like two human beings is your selfie camera can see like the entire street. Let's try and get the biggest selfie ever taken. Come on. Three, two, one. Okay, nice. Let's have a look what some light social media looks like. Ah, friction burn. I've actually burnt my finger."
        },
        {
            "end": 570.869,
            "start": 558.735,
            "text": " There's a... Yeah, I wasn't kidding. This is what my finger looked like the next day. Genuinely, though, if you were going to endlessly browse social media, this is a healthier way of doing it. You're standing, you're moving, it's interactive."
        },
        {
            "end": 598.582,
            "start": 573.292,
            "text": " introduces a bit of friction. Now for your favorite bit. This guy's a massive speaker head. And so when it came to the speakers on this phone, he has basically taken it upon himself to build a custom one of a kind set of speakers for this. Yeah, it needs to be as good as is possible. So it's got a transmission line subwoofer system, which means that it gets the most out of the space for deep and powerful audio."
        },
        {
            "end": 618.172,
            "start": 598.582,
            "text": " bass. There's tubes inside that literally delay sound waves so that they come out of the phone louder. For reference, the speakers on an iPhone, which are already some of the loudest, most powerful speakers that you can get on a smartphone, these things operate at up to around 3 watts of max power. This has 50 watts."
        },
        {
            "end": 648.172,
            "start": 619.265,
            "text": " Per speaker unit, there are eight units in total, including four subwoofer drivers purely for bass. Oh yeah, the buttons. The buttons, by the way, they feel absolutely giant, which feels like an obvious thing to say given the scale of them, but it's actually thanks to a very specific engineering decision. Yeah, behind each button is a pneumatic cylinder. These limit the speed at which the buttons can operate, giving them a sense of scale."
        },
        {
            "end": 676.456,
            "start": 648.009,
            "text": " Yeah, and it's super satisfying. But the key thing we wanted to test here is speakers. So let's see what a video call looks like on our phone. So the idea is we're currently calling you on a normal iPhone 15 Pro. I'm going to step back. We're just going to see how far away this call starts to become a problem. Okay, so this is probably two meters. Is this about the point where it disintegrates? This is the point where your foot starts to look like it's about this long."
        },
        {
            "end": 703.145,
            "start": 676.575,
            "text": " Why do I have big feet? Just the distortion of the edge of the legs. Oh, okay. So at about this distance, your face is starting to become dots to me. I mean, can you even hear me? I'm starting to make out about 85% of the words you're giving me. It's your noise cancellation isn't sure what's you and what's noise. Okay, that's actually spot on the feedback we wanted. Did you say you use a Galaxy Note 9 as your phone? Yeah, it's in great condition."
        },
        {
            "end": 732.701,
            "start": 704.101,
            "text": " This has got to be, this is some sort of joke. There's got to be a reason beyond that's the phone you like. Oh, there's a new bracket this morning. I dropped it off the side of my bed this morning. It's art. He's doing an art thing. It's got to be. I just really hate switching phones. I'm going to call you on the biggest iPhone now. I feel Paul for the first time in my life. Like, does it like work, work? It works, it works, works. Yeah, it's clustered. Yeah, it's literally a giant phone screen blown up. So what about here? I assume you can still see us."
        },
        {
            "end": 753.896,
            "start": 733.043,
            "text": " I mean, yeah, sure. You guys look small. Let's go stupidly far back. You can hear me, you can see me. The sound is very good. Okay, well, thank you. I love the fact that the camera is mounted so high. It's very clear as soon as you jump on the call with someone, they are like towering above you. I know, yeah, yeah. How much does this thing weigh? Hold on, let me guess, let me guess. I'm going to say $100,000."
        },
        {
            "end": 774.561,
            "start": 753.896,
            "text": " and 10 kilos. Not a bad guess. Times it by three. So just to establish, we can have a full-on conversation video call from here, which is like 30 meters away from the phone. Great. Easy. All right, take care, guys. You have a great evening. Congrats on all the hard work. This seems like it was an incredible undertaking."
        },
        {
            "end": 793.043,
            "start": 774.561,
            "text": " Yes. Congratulations, you guys. Thank you. Bye. Bye, Linus. Now, this, this screen right here is one of the things that we are most proud of. What we could have done and what we probably should have done in hindsight because it would have been a thousand times easier is just bought one of the already readily available touchscreen LCD TVs. But we didn't want to do that."
        },
        {
            "end": 822.2239999999999,
            "start": 793.043,
            "text": " Basically, every top-end phone nowadays uses an OLED display. It uses that because it has infinitely better contrast than LCD. It has infinitely better viewing angles. The only reason you can actually see the screen from where you are is because we use this. We basically decided that if we're building the best, we need to use the best. So we found an 8K, 88-inch OLED TV from LG. It looked absolutely beautiful in person. So we covered our eyes and we clicked that purchase button because this screen alone retails for $25,000."
        },
        {
            "end": 851.575,
            "start": 822.2239999999999,
            "text": " And since it doesn't actually exist as a touchscreen, we had to turn it into one. And that, that was a pain in the bum. Yeah, we actually broke one of these TVs during this process. It's just so difficult because what we have to do is optically laminate a touch layer onto the TV. And it's necessary to use some highly specialized optical glue for this so that it retains the OLED image quality. Yeah, and the optical glue was only available in like 50 milliliter bottles."
        },
        {
            "end": 879.442,
            "start": 851.575,
            "text": " Yeah, we basically bought the UK's entire supply of this glue. You cannot buy it right now because we bought them out. So sorry, phone repair people. The first TV actually broke because of this glue. It's extremely runny and there was a tiny gap all the way around the TV, which it flowed into and onto some circuitry, completely destroying it. We got a 6am distress call from Matt. I think he'd broken down, basically. Things were not going to plan."
        },
        {
            "end": 908.111,
            "start": 879.442,
            "text": " It was literally the worst thing that could have possibly happened. But we got through it. We've got a perfectly working one now. And honestly, this is pretty remarkable because you wouldn't usually see this outside of a factory setting. No one else would be stupid enough to make one. So stupid. Yeah, exactly. Do not try this at home. This might actually be the only 88-inch touchscreen OLED in the country. Very possibly. In the world. This is bespoke. Yeah. Oh, and also, we couldn't forget this."
        },
        {
            "end": 930.892,
            "start": 910.193,
            "text": " Introducing Dynamic Continent. It's just like Dynamic Island, but it is bigger."
        },
        {
            "end": 949.3910000000001,
            "start": 933.2470000000001,
            "text": " Okay, anyway, to keep the whole thing powered, for context, a pro level iPhone has between a 13 and a 17 watt hour battery. What we have is two Anker Solix 3840 watt hour batteries."
        },
        {
            "end": 972.172,
            "start": 952.326,
            "text": " These ones. So yes, when one runs out, you can replace it immediately. Replaceable batteries. Don't you love to see it? And I love this. We have technically built our own port to be able to power the thing. Because, I mean, a normal USB-C wouldn't be close to enough power. And a kettle cable on its own, which is what is powering it, would just look a bit silly."
        },
        {
            "end": 998.169,
            "start": 972.009,
            "text": " So, welcome to USB-C Pro Max Ultra as well. Why not? Pro Maximus. It's even magnetized so that it doesn't fall out. Take that, Apple. Technically, we just brought MagSafe to the charging port of an iPhone before Apple did. Yeah. Yeah, I think it's pretty safe to say that. Yeah. Cool. So, do you remember I was telling you that there's one more camera feature we wanted to talk about?"
        },
        {
            "end": 1028.766,
            "start": 999.892,
            "text": " It's this. An Apple iPhone's flash module sits in the power range of 0.5 to 2 watts. We have managed to build in a 400 watt light source. Plus, it's got a lens to focus the light and throw it even further. 400 watts is so much power concentrated into a very small space. That is also why we need the second water pooling system, by the way. Okay, let's test it. Starting with a normal iPhone."
        },
        {
            "end": 1059.654,
            "start": 1030.831,
            "text": " How illuminated am I? Not very. I'll be honest. You're, like, lit like a candle. Yeah, it feels like we're having, like, a romantic dinner right now. So, do you want to see the giant iPhone's flashlight? Are you going to blind me? Maybe. All right. Three, two, one. It's like the sunlight! It's actually really warm. You could sunbathe."
        },
        {
            "end": 1078.783,
            "start": 1061.48,
            "text": " I feel like someone's used like a Dragon Ball Z move on me. That's phenomenal. That could light our videos. Yes, it very well could. It's a toasty thing. My God, it's like a radiator. Features you didn't know you wanted on your phone. And now, the final thing before these Guinness World Records people come."
        },
        {
            "end": 1098.374,
            "start": 1078.783,
            "text": " How well can this 88-inch supercomputer high-end photography hi-fi phone actually do in your daily tasks? So we need to see if I can use it to buy stuff. We need to find out if we can make a payment with this thing. So thankfully, there is an ice cream stop right in front of us and I could kind of do with one right now. Okay, guys, pivot. Pivot."
        },
        {
            "end": 1114.329,
            "start": 1099.108,
            "text": " Let's go for one scoop of brownie ice cream, please. Thank you very much. Oh, sorry. Sorry. Would you mind touching about here? You'll have to borrow. I can come. I can do it. All right. Okay. We haven't tested this. This may not work. £3.60."
        },
        {
            "end": 1150.2,
            "start": 1121.565,
            "text": " If I just go slowly enough, we'll eventually come across it. I heard something. Yeah, no, it's fine. Ah, you heard it. Oh! Yes! It worked! It worked! Yes! Yes! Congratulations. You made a payment. I feel like now might be a pretty good time to email Mr. Tim Apple himself. Tim Cook at Apple."
        },
        {
            "end": 1172.776,
            "start": 1151.206,
            "text": " Oh, God. Someone's got to be monitoring that inbox. Huge update sent from my Mahoosive iPhone. Perfect. Okay, I'm just going to send it, but just give me a sec. All right, Tim, if you're watching this or reading this, I would like a good morning back."
        },
        {
            "end": 1200.643,
            "start": 1176.019,
            "text": " We need to see if I can use it to watch TV before bed. Every night before I sleep, I throw a show onto my laptop. So... Gently does it. Oh, my God. It's like a home cinema. That's it, I think."
        },
        {
            "end": 1219.415,
            "start": 1201.155,
            "text": " It's the new setup. Quality is absolutely insane. I can see every pore on people's skin. Let's see if I can set an alarm for tomorrow. Well, that seems like a reasonable time. Good night."
        },
        {
            "end": 1234.688,
            "start": 1224.671,
            "text": " So that is what our iPhone can do. The only thing left now is to see if it's good enough to win an official world record. Hello, hey. Nice to meet you."
        },
        {
            "end": 1262.879,
            "start": 1235.422,
            "text": " And this looks like a massive iPhone. It does. And I'll be looking at things like, are all the exterior buttons working, the touchscreen navigation, the touchscreen keyboard, all these usual functions that you typically see with your average smartphone. Okay. Okay. And the record is determined by the length of this item, but I also need to confirm that it is a scaled-up version of the actual dimensions of an iPhone. I believe he's already getting to work on confirming that it is a 15 times scaled-up version of the original."
        },
        {
            "end": 1286.4279999999999,
            "start": 1263.34,
            "text": " I'm getting really nervous. She keeps talking about ratios. I didn't quite expect just how seriously these guys take their measurements. It has to be spot on. I'm scared. It has to work. It has to work. Hey, thanks for coming. I know. Social media is very large. Your memes are 8K. Oh my God, this is crazy."
        },
        {
            "end": 1296.172,
            "start": 1286.7350000000001,
            "text": " What? Okay, showtime. Let's start with the exterior buttons. So this is the lock button. So as it would be on an iPhone, that locks it. Brilliant."
        },
        {
            "end": 1314.387,
            "start": 1296.009,
            "text": " They require power, but that's for a reason, to make them feel giant. So what you're doing there is changing the volume. And that top button is an action button. So the latest iPhones allow you to configure it to do one action you want, like turning on the flashlight, which is what we've done. So that is our flashlight, which is a 400-watt torch, basically."
        },
        {
            "end": 1331.486,
            "start": 1314.387,
            "text": " Looking good. We're off to a good start. Let's look at some touchscreen navigation. Instagram, for example. Let's tap that. This is our page. I know it looks like I'm holding it together at this point, but I was on breaking point. I was so scared that in the moment something she wanted to see would just not work and that would be it."
        },
        {
            "end": 1350.701,
            "start": 1331.486,
            "text": " Well, this record, of course, it must be based on a commercially available phone. It is a brilliant scaled-up version. The demonstration, everything you've just shown me, has gone very smoothly. So I can confirm that what you have achieved today is, in fact, a new Guinness World Record. Oh, my God! You did it. Thank you."
        },
        {
            "end": 1376.247,
            "start": 1352.596,
            "text": " Let's go! The excitement is justified. You have achieved the largest smartphone replica at 2.054 meters. It's very impressive, very slick, made to a high standard, so it gives me great pleasure to present you with this official certificate. Congratulations, you're officially amazing. That is incredible. Guys, well done. Well done, we did it!"
        },
        {
            "end": 1401.128,
            "start": 1378.09,
            "text": " Thank you. Thank you so much. Okay. Have a look at the video on DIY Perks' channel for him building the thing as well as many other things like it. And I just want to say it feels like the start of a new era for the Misty is the Boss channel. There's a new theme song for starters, but also just generally a lot of things that we've been working on in the background that we can finally start to talk about. So it's going to be a good time. I'll catch you in the next one."
        },
        {
            "end": 1408.944,
            "start": 1404.968,
            "text": " Yes, we did."
        }
    ]
}